function [ T ] = GETELEMS(  )
%取得有限单元，本题中全部采用三角形单元，以及第三类边界条件
%输出：
%   T, 列向量，每行为一结构体，包含组成当前单元的点编号i,j,m,n; n为零表示此单元是三角形单元

%这一片是包含有四边形单元的测试数据
%T(1).i = 1; T(1).j = 2; T(1).m = 3; T(1).n = 4;
%T(2).i = 2; T(2).j = 5; T(2).m = 4; T(2).n = 0;
%T(3).i = 3; T(3).j = 4; T(3).m = 7; T(3).n = 6;
%T(4).i = 4; T(4).j = 5; T(4).m = 8; T(4).n = 7;
%T(5).i = 5; T(5).j = 9; T(5).m = 8; T(5).n = 0;

%这一片是全为三角形单元的测试数据
T(1).i = 1; T(1).j = 4; T(1).m = 3; T(1).n = 0;
T(2).i = 1; T(2).j = 2; T(2).m = 4; T(2).n = 0;
T(3).i = 2; T(3).j = 5; T(3).m = 4; T(3).n = 0;
T(4).i = 3; T(4).j = 7; T(4).m = 6; T(4).n = 0;
T(5).i = 3; T(5).j = 4; T(5).m = 7; T(5).n = 0;
T(6).i = 4; T(6).j = 8; T(6).m = 7; T(6).n = 0;
T(7).i = 4; T(7).j = 5; T(7).m = 8; T(7).n = 0;
T(8).i = 5; T(8).j = 9; T(8).m = 8; T(8).n = 0;

end

