function [ pt ] = GETPOINTS(  )
%取得有限元网络中的点集，本题中直接在该函数中将题目数据给出。
%未来版本可能将此函数改为一个读取数据文件的函数
%输出：
%   pt, 为一个n维列向量，行号即为点的编号，每行的元素为一struct,包含该点的x,y坐标，边界值t

pt(1).x = 0;     pt(1).y = 0;     pt(1).t = 100;
pt(2).x = 0.1;   pt(2).y = 0;     pt(2).t = 100;
pt(3).x = 0;     pt(3).y = 0.1;   pt(3).t = NaN;
pt(4).x = 0.1;   pt(4).y = 0.1;   pt(4).t = NaN;
pt(5).x = 0.2;   pt(5).y = 0.1;   pt(5).t = NaN;
pt(6).x = 0;     pt(6).y = 0.2;   pt(6).t = 30;
pt(7).x = 0.1;   pt(7).y = 0.2;   pt(7).t = 30;
pt(8).x = 0.2;   pt(8).y = 0.2;   pt(8).t = 30;
pt(9).x = 0.3;   pt(9).y = 0.2;   pt(9).t = 30;

end

